# -*- coding: utf-8 -*-
import testlibrary
tp=testlibrary.testlibrary()

#组装0107body
def get_0107body(version):
    """
    13版本：终端类型（word）+制造商id（b5）+终端型号（b20）+终端id（b7）+sim卡iddid（bcd10）
    +终端硬件版本长度（b）+硬件版本号+终端固件版本长度（b）+固件版本号+GNSS模块（b）+通信模块（b）

    19版本：终端类型（word）+制造商id（b11）+终端型号（b30）+终端id（b30）+sim卡iddid（bcd10）
    +终端硬件版本长度（b）+硬件版本号+终端固件版本长度（b）+固件版本号+GNSS模块（b）+通信模块（b）
    """
    if version==0:
        parm = "0008" + "3131323334" + "3131323334313132333431313233343131323334" + \
               "31313233343639"+"31313233343131323334"+"08312E382E352E3132"+"08312E382E352E3132"+"08"+"08"
    elif version==1:
        parm="0000"+"3130303030303131323334"+\
             "313132333431313233343131323334313132333434343435353535353538"+\
             "313132333431313233343131323334313132333434343435353535353538"+\
             "31313233343131323334"+\
             "08312E382E352E3132"+\
             "08312E382E352E3132"+"08"+"08"
    return parm